base/DataProcessors/бит_ФормированиеЗаявокНРДСПоПервичнымДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ФормированиеЗаявокНРДСПоПервичнымДокументам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПервичныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Закрыть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/DataProcessors/бит_ФормированиеЗаявокНРДСПоПервичнымДокументам/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыНастроекПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если (ТекущаяСтраница = Элементы.СтраницаНастройкиКомпоновщикаОтбор
	  ИЛИ ТекущаяСтраница = Элементы.СтраницаНастройкиКомпоновщикаПорядок) И ИзмененыВыбранныеТипы Тогда
		Если ТипыДокументовЗаполненыПравильно() Тогда
			ОбработатьИзменениеВыбранныхТипов();
		Иначе	
			ТекущаяСтраница = Элементы.СтраницаТипыДокументов;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаВариантПриИзменении(Элемент)
	
	Объект.Период = Новый СтандартныйПериод(НастройкаПериода.Вариант);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ПервичныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.ПервичныеДокументыВидДокумента
	 ИЛИ Поле = Элементы.ПервичныеДокументыНомер 
	 ИЛИ Поле = Элементы.ПервичныеДокументыДата Тогда
	 	ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
	 		ПоказатьЗначение(, ТекущиеДанные.Документ);
	Иначе	
		бит_РаботаСДиалогамиКлиент.ОбработкаВыбораПоляТабличногоПоля("ПервичныеДокументы", 
			Объект.ПервичныеДокументы, Поле, ВыбраннаяСтрока);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыДокументов

&НаКлиенте
Процедура ТипыДокументовПриИзменении(Элемент)
	
	ИзмененыВыбранныеТипы = Истина;
	
КонецПроцедуры
	
#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТипыДокументов

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	Оповещение	   = Новый ОписаниеОповещения("ВыбратьНастройкиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте 
Процедура ВыбратьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда        
		ПрименитьНастройки(Результат);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если НЕ ПериодЗаполненПравильно() ИЛИ НЕ ТипыДокументовЗаполненыПравильно() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СохраняемыеНастройки());
	
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		УстановитьЗаголовок(Результат, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры // СохранитьНастройки()

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Объект.Период;
	
	Оповещение = Новый ОписаниеОповещения("НастроитьПериодЗавершение", ЭтотОбъект);
	Диалог.Показать(Оповещение);

КонецПроцедуры

// Обработчик завершения редактирования периода.
//  См. Синтакс-помощник: Показать().
// 
&НаКлиенте 
Процедура НастроитьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Объект.Период = РезультатВыбора;
		Если РезультатВыбора.Вариант <> ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
			НастройкаПериода = РезультатВыбора;		
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ПериодЗаполненПравильно() Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ТипыДокументовЗаполненыПравильно() Тогда
		Возврат;
	КонецЕсли;
	
	СкрытьНастройки();
		
	ДобавленныеДокументы.Очистить();
	УстановитьОтборСформированныхДокументов(СформированныеДокументы, ДобавленныеДокументы);

	НачатьЗаполнениеСпискаДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыСнятьФлажки(Команда)
	
	ОбработатьФлагиПервичныеДокументы(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыУстановитьФлажки(Команда)
	
	ОбработатьФлагиПервичныеДокументы(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если Объект.ПервичныеДокументы.Количество() = 0 Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , 
							"Заполнение",,,НСтр("ru = 'Подобранные документы'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ПервичныеДокументы", "Объект");
		Возврат;
	КонецЕсли;
	
	ЕстьВыбраныеСтроки = Ложь;
	Для каждого СтрокаТаблицы Из Объект.ПервичныеДокументы Цикл
		Если СтрокаТаблицы.Пометка Тогда
			ЕстьВыбраныеСтроки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьВыбраныеСтроки Тогда
		ТекстСообщения = НСтр("ru='Не выбраны документы для обработки.';
							  |en='Documents not selected for processing.'");
		ПоказатьПредупреждение(, ТекстСообщения, 30);
	Иначе
		НачатьСозданиеДокументов();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПериодЗаполненПравильно()

	ЗаполненПравильно = Истина;
	
	Отказ  = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Период.ДатаНачала) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Начало периода';en = 'Period start'")); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаНачала", "Объект", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Период.ДатаОкончания) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Конец периода';en = 'Period end'")); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаОкончания", "Объект", Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Период.ДатаНачала) И ЗначениеЗаполнено(Объект.Период.ДатаОкончания) Тогда
		Если Объект.Период.ДатаОкончания < Объект.Период.ДатаНачала Тогда
			ТекстСообщения = НСтр("ru='Период указан неверно. Дата начала больше даты окончания.';
								  |en='The period is incorrect. The start date is greater than the end date.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаНачала", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли; 
	
	Если Отказ Тогда
		ЗаполненПравильно = Ложь;
	КонецЕсли;  
	
	Возврат ЗаполненПравильно; 

КонецФункции

&НаКлиенте
Функция ТипыДокументовЗаполненыПравильно()

	ПометкаУстановлена = Ложь;
	
	Для каждого Элемент Из ТипыДокументов Цикл
		Если Элемент.Пометка Тогда
			ПометкаУстановлена = Истина;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если НЕ ПометкаУстановлена Тогда
		ОткрытьНастройки();
		
		ТекстПояснения = НСтр("ru = 'Выберите типы документов.'; en = 'Select the document types.'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , "КОРРЕКТНОСТЬ",,,
							НСтр("ru = 'Типы документов'; en = 'Types of documents'"), ТекстПояснения);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ТипыДокументов");
	КонецЕсли;
	
	Возврат ПометкаУстановлена;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФоновоеЗаполнение

&НаКлиенте
Процедура НачатьЗаполнениеСпискаДокументов()

	Если НЕ ТипыДокументовЗаполненыПравильно() Тогда
		Возврат;
	КонецЕсли;

	ДлительнаяОперация = ЗапуститьФоновоеЗаполнениеСпискаДокументов();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения 	   = НСтр("ru = 'Идет заполнение списка документов'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаполненияСпискаДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеЗаполненияСпискаДокументов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыСДокументами.ТекущаяСтраница = Элементы.СтраницаПервичныеДокументы;
	
	Если Результат.Статус <> "Выполнено" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе
		ПослеЗаполненияСпискаДокументовНаСервере(Результат.АдресРезультата)	
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗаполнениеСпискаДокументов()
		
	// Заполнение пераметов длительной операции.
	НаименованиеЗадания = НСтр("ru = 'Заполнение списка документов.'");
	ВыполняемыйМетод	= "Обработки.бит_ФормированиеЗаявокНРДСПоПервичнымДокументам.ЗаполнитьПереченьДокументов";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	НастройкиКомпоновки 	   = Объект.КомпоновщикНастроек.ПолучитьНастройки(); 
	АдресСхемыКомпоновкиДанных = ИнициализироватьКомпоновщик(Объект.КомпоновщикНастроек);
	СКД 					   = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	НастройкиКомпоновкиДанных  = Объект.КомпоновщикНастроек.ПолучитьНастройки();
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "Период", Объект.Период);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "ПрогнозПлатежаПредставлениеВида", 
		НСтр("ru = 'Прогноз платежа'; en = 'Prediction payment'"));

	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
						СКД, НастройкиКомпоновкиДанных);
	Возврат ФоновоеЗадание;

КонецФункции

&НаСервере
Процедура ПослеЗаполненияСпискаДокументовНаСервере(АдресРезультата)

	РезультатПоиска    = Объект.ПервичныеДокументы.НайтиСтроки(Новый Структура("Пометка", Истина));
	ОтмеченыеДокументы = Новый Массив;
	Для каждого Элемент Из РезультатПоиска Цикл
		ОтмеченыеДокументы.Добавить(Элемент.Документ);
	КонецЦикла;
	
	ТаблицаДокументов = ПолучитьИзВременногоХранилища(АдресРезультата);
	НайденоСтрок 	  = ТаблицаДокументов.Количество();

	Объект.ПервичныеДокументы.Загрузить(ТаблицаДокументов);
	
	Если ЗначениеЗаполнено(ОтмеченыеДокументы) Тогда
		Для каждого СтрокаТаблицы  Из Объект.ПервичныеДокументы Цикл
			СтрокаТаблицы.Пометка = ОтмеченыеДокументы.Найти(СтрокаТаблицы.Документ) <> Неопределено;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеСозданиеЗаявок

&НаКлиенте
Процедура НачатьСозданиеДокументов()

	ДлительнаяОперация = ЗапуститьФоновоеСозданиеДокументов();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения 	   = НСтр("ru = 'Идет обработка списка документов'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеСозданияДокументов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ПослеСозданияДокументовНаСервере();
		НачатьЗаполнениеСпискаДокументов();
		Элементы.СтраницыСДокументами.ТекущаяСтраница = Элементы.СтраницаСформированныеДокументы;
	Иначе
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеСозданиеДокументов()
	
	АдресРезультата	   = ПоместитьВоВременноеХранилище(Новый Массив, УникальныйИдентификатор);
	ПервичныеДокументы = Объект.ПервичныеДокументы.Выгрузить();

	ПараметрыСоздатьДокументы = Обработки.бит_ФормированиеЗаявокНРДСПоПервичнымДокументам.НовыеПараметрыСоздатьДокументы();
	ЗаполнитьЗначенияСвойств(ПараметрыСоздатьДокументы, Объект);
	
	ПараметрыСоздатьДокументы.АдресРезультата = АдресРезультата;

	// Заполнение пераметов длительной операции.
	НаименованиеЗадания = НСтр("ru = 'Создание заявок на расходование ДС по первичным документам'");
	ВыполняемыйМетод	= "Обработки.бит_ФормированиеЗаявокНРДСПоПервичнымДокументам.СоздатьДокументы";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ВыполняемыйМетод, ПервичныеДокументы, ПараметрыСоздатьДокументы);
	Возврат ФоновоеЗадание;

КонецФункции

&НаСервере
Процедура ПослеСозданияДокументовНаСервере()

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Для каждого Элемент Из Результат Цикл
		ДобавленныеДокументы.Добавить(Элемент);
	КонецЦикла; 
	УстановитьОтборСформированныхДокументов(СформированныеДокументы, ДобавленныеДокументы);

КонецПроцедуры
	
#КонецОбласти // ФоновоеСозданиеЗаявок

&НаКлиентеНаСервереБезКонтекста
Функция НастраиваемыйОбъект()

	Возврат "Обработка.бит_ФормированиеЗаявокНРДСПоПервичнымДокументам";

КонецФункции

&НаСервере
Функция ИнициализироватьКомпоновщик(КомпоновщикНастроек)

	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	ВыбранныеТипы = Обработки.бит_ФормированиеЗаявокНРДСПоПервичнымДокументам.ВыбранныеТипы(ТипыДокументов);
	
	АдресСКД = Обработки.бит_ФормированиеЗаявокНРДСПоПервичнымДокументам.ИнициализироватьКомпоновщик(КомпоновщикНастроек, 
						ВыбранныеТипы, НастройкиКомпоновкиДанных);
	
	Возврат АдресСКД;
	     
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	Перем НастройкаПоУмолчанию;

	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект());
	
	Обработки.бит_ФормированиеЗаявокНРДСПоПервичнымДокументам.ЗаполнитьТипыДокументов(ТипыДокументов);
	
	ПрименитьНастройки(НастройкаПоУмолчанию);

	УстановитьОтборСформированныхДокументов(СформированныеДокументы, ДобавленныеДокументы);

КонецПроцедуры

&НаСервере
Процедура ПрименитьНастройки(НастройкаПодбораДокументов)

	Обработки.бит_ФормированиеЗаявокНРДСПоПервичнымДокументам.ПрименитьНастройки(
		НастройкаПодбораДокументов, ТипыДокументов, Объект);
	УстановитьЗаголовок(НастройкаПодбораДокументов, ЭтотОбъект);
	
	НастройкаПериода = Объект.Период;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСформированныхДокументов(Список, ЗначениеОтбора)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"Ссылка",ЗначениеОтбора, ВидСравненияКомпоновкиДанных.ВСписке,,,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
КонецПроцедуры
		
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовок(Настройка, Форма)

	Заголовок = НСтр("ru = 'Создание заявок %1'; en = 'Creating applications %1'");
	Если ЗначениеЗаполнено(Настройка) Тогда
		Заголовок = СтрШаблон(Заголовок, "(" + Строка(Настройка) + ")");
	Иначе	
		Заголовок = СтрШаблон(Заголовок, "");
	КонецЕсли;

	Форма.Заголовок = Заголовок;

КонецПроцедуры

&НаКлиенте
Функция ПараметрыХраненияНастроек()

	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("ТипНастройки",		  ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыХранения.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());

	Возврат ПараметрыХранения;
	
КонецФункции

&НаСервере
Функция СохраняемыеНастройки()
	
	СохраняемыеНастройки = Обработки.бит_ФормированиеЗаявокНРДСПоПервичнымДокументам.НовыеСохраняемыеНастройки();

	СохраняемыеНастройки.ВариантПериода 		   = НастройкаПериода.Вариант;
	СохраняемыеНастройки.ВыбранныеТипы			   = Обработки.бит_ФормированиеЗаявокНРДСПоПервичнымДокументам.ВыбранныеТипы(ТипыДокументов);
	СохраняемыеНастройки.НастройкиКомпоновкиДанных = Объект.КомпоновщикНастроек.ПолучитьНастройки();
	
	Возврат СохраняемыеНастройки;
	
КонецФункции

&НаКлиенте
Процедура СкрытьНастройки()

	Если ТипыДокументовЗаполненыПравильно() Тогда
		Элементы.РазделыОбработки.ТекущаяСтраница 				  = Элементы.Обработка;
		Элементы.ПервичныеДокументыСформировать.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница	  = Элементы.НастройкиОбработки;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;	

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлагиПервичныеДокументы(Пометка)
	
	Для Каждого ТекущаяСтрока Из Объект.ПервичныеДокументы Цикл
		ТекущаяСтрока.Пометка = Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеВыбранныхТипов()
	
	ИнициализироватьКомпоновщик(Объект.КомпоновщикНастроек);
	
	ИзмененыВыбранныеТипы = Ложь;
	
КонецПроцедуры

#КонецОбласти
